RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_usdhc.c
        command->flags |= (uint32_t)kUSDHC_DataPresentFlag;
    }

    /* if the DMA desciptor configure fail or not needed , disable it */
    if (error != kStatus_Success)
    {
        enDMA = false;
        /* disable DMA, using polling mode in this situation */
        USDHC_EnableInternalDMA(base, false);
    }
#if defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL
    else
    {
        if (data->txData != NULL)
        {
            /* clear the DCACHE */
            DCACHE_CleanByRange((uint32_t)data->txData, (data->blockSize) * (data->blockCount));
        }
        else
        {
            /* clear the DCACHE */
            DCACHE_CleanInvalidateByRange((uint32_t)data->rxData, (data->blockSize) * (data->blockCount));
        }
    }
#endif

    /* config the data transfer parameter */
    error = USDHC_SetTransferConfig(base, transferFlags, blockSize, blockCount);
    if (error != kStatus_Success)
    {
        return error;
    }
    /* send command first */
    USDHC_SendCommand(base, command);
    /* wait command done */
    error =
        USDHC_WaitCommandDone(base, command, (data == NULL) || (data->dataType == (uint32_t)kUSDHC_TransferDataNormal));
    if (kStatus_Success != error)
    {
        return kStatus_USDHC_SendCommandFailed;
    }

    /* wait transfer data finsih */
    if (data != NULL)
    {
        error = USDHC_TransferDataBlocking(base, data, enDMA);
        if (kStatus_Success != error)
        {
            return error;
        }
    }

    return kStatus_Success;
}

#if (defined FSL_USDHC_ENABLE_SCATTER_GATHER_TRANSFER) && FSL_USDHC_ENABLE_SCATTER_GATHER_TRANSFER
static status_t USDHC_SetScatterGatherAdmaTableConfig(USDHC_Type *base,
                                                      usdhc_adma_config_t *dmaConfig,
                                                      usdhc_scatter_gather_data_t *dataConfig,
                                                      uint32_t *totalTransferSize)
{
    assert(NULL != dmaConfig);
    assert((NULL != dmaConfig->admaTable) &&
           (((USDHC_ADMA_TABLE_ADDRESS_ALIGN - 1U) & (uint32_t)dmaConfig->admaTable) == 0UL));
    assert(NULL != dataConfig);

    status_t error                               = kStatus_Fail;
    uint32_t *admaDesBuffer                      = dmaConfig->admaTable;
    uint32_t admaDesLen                          = dmaConfig->admaTableWords;
    usdhc_scatter_gather_data_list_t *sgDataList = &dataConfig->sgData;
    uint32_t oneDescriptorMaxTransferSize        = dmaConfig->dmaMode == kUSDHC_DmaModeAdma1 ?
                                                USDHC_ADMA1_DESCRIPTOR_MAX_LENGTH_PER_ENTRY :
                                                USDHC_ADMA2_DESCRIPTOR_MAX_LENGTH_PER_ENTRY;
    uint32_t miniEntries = 0U;

    while (sgDataList != NULL)
    {
        if (dmaConfig->dmaMode == kUSDHC_DmaModeAdma1)
        {
            error = USDHC_SetADMA1Descriptor(admaDesBuffer, admaDesLen, sgDataList->dataAddr, sgDataList->dataSize, 0U);
        }
        /* ADMA2 */
        else
        {
            error = USDHC_SetADMA2Descriptor(admaDesBuffer, admaDesLen, sgDataList->dataAddr, sgDataList->dataSize, 0U);
        }

        if (error != kStatus_Success)
        {
            return kStatus_USDHC_PrepareAdmaDescriptorFailed;
        }

#if defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL
        if (dataConfig->dataDirection == kUSDHC_TransferDirectionSend)
        {
            /* clear the DCACHE */
            DCACHE_CleanByRange((uint32_t)sgDataList->dataAddr, sgDataList->dataSize);
        }
        else
        {
            /* clear the DCACHE */
            DCACHE_CleanInvalidateByRange((uint32_t)sgDataList->dataAddr, sgDataList->dataSize);
        }
#endif

        *totalTransferSize += sgDataList->dataSize;
        if (sgDataList->dataList != NULL)
        {
            if ((sgDataList->dataSize % oneDescriptorMaxTransferSize) == 0UL)
            {
                miniEntries = sgDataList->dataSize / oneDescriptorMaxTransferSize;
            }
            else
            {
                miniEntries = ((sgDataList->dataSize / oneDescriptorMaxTransferSize) + 1UL);
            }
            if (dmaConfig->dmaMode == kUSDHC_DmaModeAdma1)
            {
                admaDesBuffer[miniEntries * 2U - 1U] &= ~kUSDHC_Adma1DescriptorEndFlag;
            }
            else
            {
                admaDesBuffer[miniEntries * 2U - 2U] &= ~kUSDHC_Adma2DescriptorEndFlag;
            }
            admaDesBuffer += miniEntries * 2U;
            admaDesLen -= miniEntries * 2U;
        }

        sgDataList = sgDataList->dataList;
    }

    base->DS_ADDR       = 0UL;
    base->ADMA_SYS_ADDR = (uint32_t)(dmaConfig->admaTable);

    /* select DMA mode and config the burst length */
    base->PROT_CTRL &= ~(USDHC_PROT_CTRL_DMASEL_MASK);
    base->PROT_CTRL |= USDHC_PROT_CTRL_DMASEL(dmaConfig->dmaMode);

    /* enable DMA */
    base->MIX_CTRL |= USDHC_MIX_CTRL_DMAEN_MASK;

    return error;
}

/*!
 * brief Transfers the command/scatter gather data using an interrupt and an asynchronous method.
 *
 * This function sends a command and data and returns immediately. It doesn't wait for the transfer to complete or
 * to encounter an error. The application must not call this API in multiple threads at the same time. Because of that
 * this API doesn't support the re-entry mechanism.
 * This function is target for the application would like to have scatter gather buffer to be transferred within one
 * read/write request, non scatter gather buffer is support by this function also.
 *
 * note Call API @ref USDHC_TransferCreateHandle when calling this API.
 *
 * param base USDHC peripheral base address.
 * param handle USDHC handle.
 * param dmaConfig adma configurations, must be not NULL, since the function is target for ADMA only.
 * param transfer scatter gather transfer content.
 *
 * retval #kStatus_InvalidArgument Argument is invalid.
 * retval #kStatus_USDHC_BusyTransferring Busy transferring.
 * retval #kStatus_USDHC_PrepareAdmaDescriptorFailed Prepare ADMA descriptor failed.
 * retval #kStatus_Success Operate successfully.
 */
status_t USDHC_TransferScatterGatherADMANonBlocking(USDHC_Type *base,
                                                    usdhc_handle_t *handle,
                                                    usdhc_adma_config_t *dmaConfig,
                                                    usdhc_scatter_gather_transfer_t *transfer)
{
    assert(handle != NULL);
    assert(transfer != NULL);
    assert(dmaConfig != NULL);

